# Target guided ordinal encoding

In [18]:
import pandas as pd 

df = pd.DataFrame({
    'city': ['New York', 'Los Angeles','Seattle', 'Chicago','Cincinnati' ,'Houston', 'Phoenix','Seattle','Cincinnati'],
    
    'price': [1000000, 800000, 600000, 100000,700000,450000000 ,900000,10000000,250000000000]
})

In [19]:
df

          city         price
0     New York       1000000
1  Los Angeles        800000
2      Seattle        600000
3      Chicago        100000
4   Cincinnati        700000
5      Houston     450000000
6      Phoenix        900000
7      Seattle      10000000
8   Cincinnati  250000000000

In [20]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [21]:
mean_price

{'Chicago': 100000.0,
 'Cincinnati': 125000350000.0,
 'Houston': 450000000.0,
 'Los Angeles': 800000.0,
 'New York': 1000000.0,
 'Phoenix': 900000.0,
 'Seattle': 5300000.0}

In [22]:
df['city_encoded'] = df['city'].map(mean_price)

In [24]:
df[['city','city_encoded']]

          city  city_encoded
0     New York  1.000000e+06
1  Los Angeles  8.000000e+05
2      Seattle  5.300000e+06
3      Chicago  1.000000e+05
4   Cincinnati  1.250004e+11
5      Houston  4.500000e+08
6      Phoenix  9.000000e+05
7      Seattle  5.300000e+06
8   Cincinnati  1.250004e+11

In [28]:
import seaborn as sns

In [29]:
tips_df = sns.load_dataset('tips')

In [30]:
mean_bill_price  = tips_df.groupby('day')['total_bill'].mean()

/var/folders/ys/1byz1_411nnfhvftzwp6vlgc0000gn/T/ipykernel_20392/899917722.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_bill_price  = tips_df.groupby('day')['total_bill'].mean()

In [31]:
mean_bill_price

day
Thur    17.682742
Fri     17.151579
Sat     20.441379
Sun     21.410000
Name: total_bill, dtype: float64

In [33]:
tips_df['bill_encoded'] = tips_df['day'].map(mean_bill_price)

In [ ]:
tips_